Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=6_lang=davvi.html.tmx
Source language: sme
Languages: eng

source: Sámedikki čoahkkin ovddasta Sámedikki bajimuš mearridanválddi.
eng: The Plenum represents the supreme authority of the Sámi Parliament.

source: Dat čoahkkana 4-5 geardde jagis.
eng: It meets 4-5 times per year.

source: Sámedikki čoahkkin mearrida váldooasis sámedikki addin cealkámušain, evttohusain ja eará oaiviliin.
eng: The Plenum decides mainly on the statements, proposals, and other comments.

source: Stáhtaráđđi mearrida sámedikki lahttun (21) ja várrelahttun (4) sámediggeválggain eanemus jienaid ožžon olbmo, goittotge nu, ahte juohke sámi ruovttuguovllu gielddas (Eanodat, Anár, Soađegilli ja Ohcejohka) bohtet uhcimustá golbma lahtu ja guđege gielddas okta várrelahttu.
eng: The Council of State appoints the people who have gained the most votes in the elections as members (21) and deputies (4).

source: Jagi 2011 válggaid boađusin doaibmabadjái 2012 - 2015 válljejuvvojedje čuovvovaš lahtut ja várrelahtut:
eng: However, every municipality of the Sámi homeland (Enontekiö, Inari, Sodankylä, and Utsjoki) must have at least three members and one deputy.

source: Magga Ulla-Maarit, II várreságajođiheaddji
eng: The members and deputies for the term of office 2008-2011 are:

source: Várrelahtut:
eng: Members:
